Repository: flutter-preview/pradyotprksh-development_learning
Catalog: flutter/second_hand_clothes/lib/l10n/app_*.arb
Languages: ar, ja

# applicationName
source: Clothes
ar: ملابس
ja: 服

source: Welcome To
ar: مرحبا بكم في
ja: ようこそ

# personaliseTitle
source: Look & Feel
ar: رأى
ja: ほら

# personaliseDescription
source: Please choose the required look and feel as per your requirement. there are options given for theme mode, theme color scheme and localization as well.
ar: يرجى اختيار الشكل والمظهر المطلوبين وفقا لمتطلباتك. هناك خيارات مقدمة لوضع السمة ونظام ألوان السمة والتعريب أيضا.
ja: あなたの要件に応じて必要なルックアンドフィールを選択してください。テーマモード、テーマの配色、ローカリゼーションにもオプションがあります。

# themeTitle
source: Theme
ar: موضوع
ja: テーマ

# themeSubTitle
source: Please select the theme that suits you the most.
ar: يرجى تحديد الموضوع الذي يناسبك أكثر.
ja: 自分に一番合うテーマを選んでください。

# themeModeUndoTitle
source: Theme changed
ar: تم تغيير النسق
ja: テーマが変更されました

# undoOption
source: Undo
ar: تراجع
ja: 外す

# colorSchemeTitle
source: Color Scheme
ar: نظام الألوان
ja: 配色

# colorSchemeSubTitle
source: Please choose a color scheme that suits you.
ar: يرجى اختيار نظام الألوان الذي يناسبك.
ja: 自分に合った配色をお選びください。

# languageTitle
source: Language
ar: اللغة
ja: 言語

# languageSubTitle
source: Please choose the language that suits you.
ar: يرجى اختيار اللغة التي تناسبك.
ja: 自分に合った言語をお選びください。

# fontTitle
source: Font
ar: الخط
ja: フォント

# fontSubTitle
source: Please choose the font that suits you.
ar: يرجى اختيار الخط الذي يناسبك.
ja: 自分に合ったフォントをお選びください。

source: Hello!!
ar: مرحبًا!!
ja: こんにちは！！

source: Hello Again!!
ar: مرحبا مرة أخرى!!
ja: こんにちは再び!!

# newUserMessage
source: Let's see what others are selling and what you can give others back.
ar: دعونا نرى ما يبيعه الآخرون وما يمكنك إعادته للآخرين.
ja: 他の人が何を売っているのか、そしてあなたが他の人に何を返すことができるのかを見てみましょう。

# emailAddressLabel
source: Email Address
ar: عنوان البريد الإلكتروني
ja: アドレス

# emailAddressError
source: Please enter a correct email address
ar: يرجى إدخال عنوان بريد إلكتروني صحيح
ja: 正しいメールアドレスを入力してください

# passwordLabel
source: Password
ar: شعار
ja: パスワード

# passwordError
source: Please enter a strong password
ar: الرجاء إدخال كلمة مرور قوية
ja: 強力なパスワードを入力してください

# authenticateButtonTitle
source: Authenticate
ar: مصادقه
ja: 認証

# authenticateOtherOptionNote
source: We also provide easier way to authenticate yourself.
ar: كما نقدم طريقة أسهل لمصادقة نفسك.
ja: また、自分自身を認証するための簡単な方法も提供します。

# somethingWentWrong
source: Something went wrong. Please try again after sometime.
ar: حدث خطأ ما. يرجى المحاولة مرة أخرى بعد مرور بعض الوقت.
ja: 何かがおかしくなった。しばらくしてからもう一度お試しください。

# okayButton
source: Okay
ar: حسنًا
ja: 大丈夫です

# formParsingError
source: Something went wrong with the form parsing. Please try again after sometime, we are looking into it.
ar: حدث خطأ ما في تحليل النموذج. يرجى المحاولة مرة أخرى بعد مرور بعض الوقت ، ونحن ننظر في ذلك.
ja: フォームの解析で問題が発生しました。しばらくしてからもう一度お試しください、私たちはそれを調べています。

# wrongFormId
source: Wrong form details was asked. Please come back again, we are looking into this.
ar: تم طرح تفاصيل نموذج خاطئة. يرجى العودة مرة أخرى ، نحن نبحث في هذا.
ja: 間違ったフォームの詳細を尋ねられました。もう一度戻ってきてください、私たちはこれを調べています。

# fetchingFormDetails
source: Fetching form details. Please wait.
ar: جلب تفاصيل النموذج. الرجاء الانتظار.
ja: フォームの詳細を取得します。お待ちください。

# formRefreshMessage
source: Something is wrong with the requested form, we are checking into this. Or can you try refreshing?
ar: هناك خطأ ما في النموذج المطلوب ، ونحن نتحقق من ذلك. أو يمكنك محاولة الانتعاش؟
ja: 要求されたフォームに何か問題があります、私たちはこれをチェックインしています。それとも、さわやかにしてみませんか?

# doNotHaveAnAccount
source: Don't have an account? Create one.
ar: ليس لديك حساب؟ إنشاء واحد.
ja: アカウントをお持ちではありませんか?作成します。

# formProcessErrorMessage
source: Something went wrong while processing the form request. Please try again or check all the details filled by you. We are looking into this as well.
ja: フォーム要求の処理中に問題が発生しました。もう一度やり直すか、記入したすべての詳細を確認してください。これも検討中です。
